// This file is autogenerated, DO NOT EDIT
// eql/eql.asciidoc:141

[source, python]
----
resp = client.eql.search(
    index="my-data-stream",
    query="\n    process where process.name == \"regsvr32.exe\"\n  ",
    size=50,
)
print(resp)
----
