// This file is autogenerated, DO NOT EDIT
// eql/eql.asciidoc:1204

[source, python]
----
resp = client.eql.search(
    index="my-data-stream",
    tiebreaker_field="event.sequence",
    query="\n    process where process.name == \"cmd.exe\" and stringContains(process.executable, \"System32\")\n  ",
)
print(resp)
----
