// This file is autogenerated, DO NOT EDIT
// eql/detect-threats-with-eql.asciidoc:277

[source, python]
----
resp = client.eql.search(
    index="my-data-stream",
    query="\n    sequence by process.pid\n      [process where process.name == \"regsvr32.exe\"]\n      [library where dll.name == \"scrobj.dll\"]\n      [network where true]\n  ",
)
print(resp)
----
