// This file is autogenerated, DO NOT EDIT
// eql/eql.asciidoc:1482

[source, python]
----
resp = client.eql.search(
    index="cluster_one:my-data-stream,cluster_two:my-data-stream",
    query="\n    process where process.name == \"regsvr32.exe\"\n  ",
)
print(resp)
----
