// This file is autogenerated, DO NOT EDIT
// eql/detect-threats-with-eql.asciidoc:94

[source, python]
----
resp = client.eql.search(
    index="my-data-stream",
    filter_path="-hits.events",
    query="\n    any where process.name == \"regsvr32.exe\"                \n  ",
    size=200,
)
print(resp)
----
