// This file is autogenerated, DO NOT EDIT
// eql/eql.asciidoc:240

[source, python]
----
resp = client.eql.search(
    index="my-data-stream",
    query="\n    sequence with maxspan=1h\n      [ process where process.name == \"regsvr32.exe\" ]\n      [ file where stringContains(file.name, \"scrobj.dll\") ]\n  ",
)
print(resp)
----
