// This file is autogenerated, DO NOT EDIT
// eql/eql.asciidoc:1253

[source, python]
----
resp = client.eql.search(
    index="my-data-stream",
    wait_for_completion_timeout="2s",
    query="\n    process where process.name == \"cmd.exe\"\n  ",
)
print(resp)
----
