// This file is autogenerated, DO NOT EDIT
// eql/detect-threats-with-eql.asciidoc:139

[source, python]
----
resp = client.eql.search(
    index="my-data-stream",
    query="\n    process where process.name == \"regsvr32.exe\" and process.command_line.keyword != null\n  ",
)
print(resp)
----
