// This file is autogenerated, DO NOT EDIT
// eql/eql-search-api.asciidoc:30

[source, python]
----
resp = client.eql.search(
    index="my-data-stream",
    query="\n    process where process.name == \"regsvr32.exe\"\n  ",
)
print(resp)
----
