// This file is autogenerated, DO NOT EDIT
// eql/eql.asciidoc:974

[source, python]
----
resp = client.eql.search(
    index="my-data-stream",
    filter_path="hits.events._source.@timestamp,hits.events._source.process.pid",
    query="\n    process where process.name == \"regsvr32.exe\"\n  ",
)
print(resp)
----
