// This file is autogenerated, DO NOT EDIT
// eql/detect-threats-with-eql.asciidoc:209

[source, python]
----
resp = client.eql.search(
    index="my-data-stream",
    query="\n    library where process.name == \"regsvr32.exe\" and dll.name == \"scrobj.dll\"\n  ",
)
print(resp)
----
