// This file is autogenerated, DO NOT EDIT
// eql/eql-search-api.asciidoc:586

[source, python]
----
resp = client.eql.search(
    index="my-data-stream",
    query="\n    process where (process.name == \"cmd.exe\" and process.pid != 2013)\n  ",
)
print(resp)
----
